app/views/authors/index.html.erb

SELECT "books".* FROM "books" WHERE "books"."author_id" = 1
---
      <dt>No Books</dt>
      <dd><%= author.books.length %></dd>