app/views/publishers/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."publisher_id" = 1
---

<% @publisher.books.each do |book| %>