app/views/books/_form.html.erb

    <div class="controls">
      <%= f.select :author_id, Author.all.collect {|c| [ c.name, c.id ] }, {include_blank: true} %>
---
SELECT "authors".* FROM "authors"

    <div class='controls'>
      <%= collection_select :book, :publisher_id, Publisher.all, :id, :name, {include_blank: true} %>
---
SELECT "publishers".* FROM "publishers"

     <div class="controls">
       <%= f.select :location_id, Location.all.collect {|c| [ c.name, c.id ] }, {include_blank: true} %>
---
SELECT "locations".* FROM "locations"