app/controllers/authors_controller.rb

  def create
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 11 Apr 2013 16:59:55 UTC +00:00], ["name", "afasd fasfasdf"], ["updated_at", Thu, 11 Apr 2013 16:59:55 UTC +00:00]]

  def update
    @author = Author.find(params[:id])

    respond_to do |format|
      if @author.update_attributes(params[:author])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "authors" SET "name" = 'abdulrahman alshetwi', "updated_at" = '2013-04-11 17:05:37.129325' WHERE "authors"."id" = 4