app/controllers/books_controller.rb

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("author_id", "category", "copies", "created_at", "isbn", "language", "location_id", "name", "pages", "publisher_id", "updated_at", "version") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "books" SET "category" = '', "pages" = '', "version" = '5', "copies" = '', "updated_at" = '2013-04-13 18:33:18.015910' WHERE "books"."id" = 1