app/controllers/locations_controller.rb

INSERT INTO "locations" ("created_at", "name", "rack", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 14 Apr 2013 19:26:36 UTC +00:00], ["name", nil], ["rack", nil], ["updated_at", Sun, 14 Apr 2013 19:26:36 UTC +00:00]]
---
  def create
    @location = Location.new(params[:author])

    respond_to do |format|
      if @location.save