app/controllers/publishers_controller.rb

  def index
    @publishers = Publisher.all
---
SELECT "publishers".* FROM "publishers"

  def show
    @publisher = Publisher.find(params[:id])
---
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = ? LIMIT 1  [["id", "3"]]

  def edit
    @publisher = Publisher.find(params[:id])
---
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @publisher = Publisher.new(params[:publisher])

    respond_to do |format|
      if @publisher.save
---
INSERT INTO "publishers" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 11 Apr 2013 17:19:42 UTC +00:00], ["name", "dhom"], ["updated_at", Thu, 11 Apr 2013 17:19:42 UTC +00:00]]

  def destroy
    @publisher = Publisher.find(params[:id])
    @publisher.destroy
---
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "publishers" WHERE "publishers"."id" = ?  [["id", 4]]