app/controllers/searches_controller.rb

SELECT "books".* FROM "books"
SELECT "authors".* FROM "authors"
SELECT "publishers".* FROM "publishers"
SELECT "locations".* FROM "locations"
---
  def index
    search = {name_contains: params[:name_contains]}

    @search     = Book.search(search)
    @books      = @search.all
    @authors    = Author.search(search)
    @publishers = Publisher.search(search)
    @locations  = Location.search(search)