app/views/locations/index.html.erb

      <dt>No Books</dt>
      <dd><%= location.books.length %></dd>
---
SELECT "books".* FROM "books" WHERE "books"."location_id" = 1