app/views/locations/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."location_id" = 1
---

<% @location.books.each do |book| %>